       01 TRIRIGA-USER-IN-COPY.
          02 TRIRIGA-USER-IN-01 OCCURS 1 TIMES.
            03  USER-ID                    PIC X(100).
            03  NAME                       PIC X(100).
            03  BUILDING-ID                PIC X(100).
            03  BUILDING-NAME              PIC X(100).
            03  FLOOD-ID                   PIC X(100).
            03  FLOOR                      PIC X(100).
            03  CUBE-ID                    PIC X(100).
            03  CUBE-NUMBER                PIC X(100).