       01 TRIRIGA-USER-OUT-COPY.
          02 TRIRIGA-USER-OUT-01 OCCURS 5 TIMES.
            03  USER-ID                    PIC X(100).
            03  BUILDING-NAME              PIC X(100).
            03  FLOOR                      PIC X(100).
            03  CUBE-NUMBER                PIC X(100).